# VertexStreamPositionNormalColored Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexStreamPositionNormalColored Class
Members See Also
---
A stream that can be used to write vertices of type VertexPositionNormalColored into a buffer (see VertexBuffer).
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class VertexStreamPositionNormalColored : VertexStream
```

Visual Basic
---
```text
Public Class VertexStreamPositionNormalColored _
	Inherits VertexStream
```

Visual C++
---
```text
public ref class VertexStreamPositionNormalColored : public VertexStream
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.DirectContext3D..::..VertexStream Autodesk.Revit.DB.DirectContext3D..::..VertexStreamPositionNormalColored
# See Also
VertexStreamPositionNormalColored Members
Autodesk.Revit.DB.DirectContext3D Namespace